{
    "projects": [
        {
            "name": "ChainWork",
            "description": "Chainwork is a decentralized platform allowing users to post tasks and get paid via the Electroneum blockchain. Chainwork utilizes smart contracts to ensure secure and transparent transactions between users. The platform is designed to provide a seamless experience for both task posters and workers, with a focus on security and ease of use.",
            "contribution": "I was responsible for implementing the blockchain payment integration system, using the MetaMask browser extension. This included building a secure wallet connection system using ethers.js, developing fiat-to-cryptocurrency conversion features with the CoinGecko API, and creating a complete transaction flow for task creation with escrow payments. Initially designed using a context-based architecture for centralized state management and later refactored to a more modular service-based approach for better maintainability. ",
            "url": "https://chainwork-payment.onrender.com/",
            "github": "https://github.com/Gallie83/Chainwork-Payment",
            "tags": ["React", "TypeScript", "Tailwind", "Blockchain"],
            "hackathon": true
        },
        {
            "name": "Best Buds Florist",
            "description": "Best Buds is a full-stack Django e-commerce application I built for a fictional florist shop. The website features a complete online store with Stripe payment integration, user authentication, and a shopping cart system. Users can browse products, leave reviews, read blog posts, and securely complete purchases with email confirmations. The platform includes admin functionality for product and content management, deployed on Heroku with AWS S3 for media storage. This project demonstrates my ability to build comprehensive e-commerce solutions with real-world payment processing and cloud deployment.",
            "url": "",
            "github": "https://github.com/Gallie83/Best-Buds-Florist",
            "tags": ["Django", "Python", "Bootstrap", "AWS", "PostgreSQL"],
            "hackathon": false
        },
        {
            "name": "Shannon Muay Thai Academy",
            "description": "Shannon Muay Thai Academy is a full-stack Django appication that I built for my local kickboxing gym in Ireland. The website contains a booking platform where users can register accounts and schedule private training sessions, as well as serving as an informational hub for the gym. The website features user authentication, dynamic availability checking that prevents double-bookings, and a complete CRUD booking management system. Users can select dates, view only available time slots, and manage their upcoming sessions with edit and delete functionality. This project holds special significance as I've trained at this gym since it opened, allowing me to create a meaningful solution that directly benefits the community I'm part of.",
            "url": "",
            "github": "https://github.com/Gallie83/PP4-Django",
            "tags": ["Django", "Python", "Bootstrap", "PostgreSQL"],
            "hackathon": false
        },
                {
            "name": "QuizCraft",
            "description": "QuizCraft is a virtual classroom platform that allows teachers to monitor students progress. The platform leverages AI to generate quizzes and tests based on the content of the course. QuizCraft was designed to streamline educators workflow and enhance the learning experience for students.",
            "contribution": "I was responsible for creatingthe entire authentication system through Firebase, as well as account and classroom functionality, and implemented all the relevant designs created by our UX designer. The users would be created through Firebase and then their additional information would be stored with MongoDB. I also worked on the backend, setting up the database and creating the API endpoints for the frontend to consume.",
            "url": "https://classrooms-0ay4.onrender.com/",
            "github": "https://github.com/rahulkumarbhagat-coder/Classrooms",
            "tags": ["React", "Tailwind", "Node.js", "Express", "MongoDB", "Firebase"],
            "hackathon": true
        }
    ]
}